final Map<String, String> brailleUnicodeMap = {
  'a': '\u2801', 
  'b': '\u2803', 
  'c': '\u2809', 
  'd': '\u2819', 
  'e': '\u2811', 
  'f': '\u280B', 
  'g': '\u281B', 
  'h': '\u2813', 
  'i': '\u280A', 
  'j': '\u281A', 
  'k': '\u2805', 
  'l': '\u2807', 
  'm': '\u280D', 
  'n': '\u281D', 
  'o': '\u2815', 
  'p': '\u280F', 
  'q': '\u281F', 
  'r': '\u2817', 
  's': '\u280E', 
  't': '\u281E', 
  'u': '\u2825', 
  'v': '\u2827', 
  'w': '\u283A', 
  'x': '\u282D', 
  'y': '\u283D', 
  'z': '\u2835', 
  '#': '\u283C',
  '1': '\u2801', 
  '2': '\u2803', 
  '3': '\u2809', 
  '4': '\u2819', 
  '5': '\u2811', 
  '6': '\u280B', 
  '7': '\u281B', 
  '8': '\u2813', 
  '9': '\u280A', 
  '0': '\u281A',
  '..': '\u2828', //mayuscula no usado
  '.': '\u2804',  // Punto
  ',': '\u2802',  // Coma
  ';': '\u2806',  // Punto y coma
  ':': '\u2812',  // Dos puntos
  '-': '\u2824',  // Guión
  '?': '\u2822',
  '¿': '\u2822',  // Signo de interrogación
  '!': '\u2816', 
  '¡': '\u2816', // Signo de exclamación
  '"': '\u2826',  // Comillas
  '(': '\u2823',  // Paréntesis izquierdo
  ')': '\u281C',  // Paréntesis derecho
  '...': '\u2804\u2804\u2804', // Puntos suspensivos
  'á':'\u2837',
  'é':'\u282E',
  'í':'\u280C',
  'ó':'\u282C',
  'ú':'\u283E',
  'ü': '\u2833',
  'ñ': '\u283B', 
};
